bgprocurementsearch/app/controllers/opportunities_controller.rb

  def search
    @setaside = param_value('setaside')
    @sol_type = param_value('sol_type')
    @pop_state = param_value('pop_state')
    @only_recovery = param_value('only_recovery')
    @only_recovery_flag = @only_recovery=="only_recovery"
    @keywords = param_value('keywords')
    @sort_c = param_value('sort_c')
    @sort_c = param_value('sort_d')
    #@opportunities = Opportunity.search @keywords, :max_matches => 10_000, :page => params[:page], :per_page => 20, :conditions => conditions
    @opportunities = Opportunity.paginate  :page => params[:page], :per_page => 20, :conditions => conditions, :order =>sort_order('created_at')
---
SELECT * FROM `opportunities` WHERE ( (opportunities.active_ind = true OR (opportunities.active_ind is null AND opportunities.resp_date >= '2009-11-30T13:13:13-05:00') OR (opportunities.active_ind is null AND opportunities.resp_date is null AND opportunities.sol_date is not null AND opportunities.sol_date >= '2009-11-15 18:13:13 UTC') ) AND opportunities.setaside != '' AND opportunities.setaside !='N/A' AND opportunities.setaside LIKE '%Women Owned Small Business%' AND opportunities.pop_state LIKE '%CO%' ) LIMIT 0, 20
SELECT count(*) AS count_all FROM `opportunities` WHERE ( (opportunities.active_ind = true OR (opportunities.active_ind is null AND opportunities.resp_date >= '2009-11-30T13:14:15-05:00') OR (opportunities.active_ind is null AND opportunities.resp_date is null AND opportunities.sol_date is not null AND opportunities.sol_date >= '2009-11-15 18:14:15 UTC') ) AND opportunities.setaside != '' AND opportunities.setaside !='N/A' AND opportunities.setaside LIKE '%Total Small Business%' AND opportunities.pop_state LIKE '%CO%' )

  def show
    @opportunity = Opportunity.find(params[:id])
---
SELECT * FROM `opportunities` WHERE (`opportunities`.`id` = 3)

  def edit
    @opportunity = Opportunity.find(params[:id])
---
SELECT * FROM `opportunities` WHERE (`opportunities`.`id` = 1)

  def update
    @opportunity = Opportunity.find(params[:id])

    respond_to do |format|
      if @opportunity.update_attributes(params[:opportunity])
---
SELECT * FROM `opportunities` WHERE (`opportunities`.`id` = 1)
UPDATE `opportunities` SET `link_url` = '', `pop_country` = '', `contact_email_desc` = '', `sol_date` = '2009-12-07', `archive_date` = '2009-12-07', `link_desc` = '', `agency_zip` = '', `recovery_ind` = 0, `agency_location` = '', `pop_zip` = '', `pop_address` = '', `subject` = 'NEEDED Subs & Suppliers to bid the construction of an Armed Forces Reserve Center at Ft Benning, GA. All trades needed including sitework, utilities, landscaping. Scope includes training building, vehicle maintenance, storage and parking.', `updated_at` = '2009-12-07 15:02:06', `archive_policy` = '', `agency_office` = '' WHERE `id` = 1